{
	"a-new-chapter-reaching-crypto-users-with-filament": {
		"metadata": {
			"category": "announcement",
			"title": "A New Chapter: Reaching Crypto Users with Filament",
			"teaser": "Mekatek and Numia announce Filament — native support for crypto project growth.",
			"published": "2023-10-13T00:00:00.000Z",
			"authors": ["Rafael Aviles"],
			"state": "published"
		},
		"content": "\nToday marks an important step for [Mekatek](https://meka.tech/) and [Numia](https://www.numia.xyz/). We're introducing [Filament](https://twitter.com/filamentzone), a project birthed from our experience running growth campaigns for protocols. Filament is our attempt to bridge gaps, fostering protocol growth, engagement, and retention across the Interchain and beyond. By leveraging wallet activity for dynamic audience segmentation, we craft end-to-end campaigns that reach effectively and ensure sustainable growth.\n\n## The Growth Conundrum\n\nAs protocols set their sights on growth, they encounter a myriad of challenges. Traditional advertising platforms, fine-tuned for the Web2 realm, often find themselves at odds with the needs of the crypto space. The disparities arise due to:\n\n- **Privacy Dilemmas:** Mainstream advertising platforms tend to undermine user privacy, which is central to crypto's ethos.\n- **Centralization Woes:** Their predominantly centralized operations starkly conflict with the decentralization that crypto champions.\n- **A Lack of Cohesiveness:** crypto isn't about bombarding platforms with disjointed promotions. We're in pursuit of cohesive solutions that complement rather than clutter.\n\n## Filament's Approach\n\nWith these challenges in mind, Filament is designed to support crypto projects in their growth and retention objectives. Our goal with Filament is to facilitate smooth interactions between campaigners with valuable messages and distributors with the right audience.\n\n### Filament's Distinctive Features\n\n_Precision Segmentation:_ utilizing on-chain data, allows for the creation of highly specific audience segments. This granularity enables campaigners to align their messages with users' actual behaviors, fostering genuine connections.\n\n### Key Capabilities of Filament\n\n- **Experimentation Support:** Filament offers A/B testing, enabling campaigners to test various campaign elements and pinpoint what works best.\n- **In-Depth Campaign Insights:** Campaigners can monitor the entire advertising journey, from initial exposure to conversion, providing a holistic view of campaign effectiveness.\n\n## The Road Ahead\n\nAs of today, Filament operates as a fully permissioned system with whitelisted participants. Our focus on quality is paramount. We're privileged to collaborate with some of the most innovative minds in the Interchain. The trust and involvement of [Keplr](https://www.keplr.app/), [Leap](https://www.leapwallet.io/), [Sommelier](https://www.sommelier.finance/), [Levana](https://www.levana.finance/) and [Quasar](https://www.quasar.fi/) have been foundational to Filament’s early shape.\n\nAdditionally we are in the process of establishing complete transparency to evolve into a privacy-preserving and decentralized system in the near future.\n\nWith the launch of Filament, we aim to further bridge the gap between crypto projects and their audiences. The platform stands as a testament to our commitment to improving campaign efficiency and distributor reach in the crypto space. As we navigate this journey, we're eager to keep the community updated on our progress and innovations.\n\nWe warmly invite you to delve deeper into Filament, understanding its conceptual architecture and envisaged integration techniques. With Filament, we are at the beginning of a journey, one that invites exploration and enlightenment. If our aspirations resonate with you and pique your interest, please do get in touch.\n\nFollow us on Twitter: [https://x.com/filamentzone](https://x.com/filamentzone)\nContact us at: [connect@filament.zone](mailto:connect@filament.zone)\n",
		"slug": "a-new-chapter-reaching-crypto-users-with-filament",
		"toc": [
			{ "name": "The Growth Conundrum", "slug": "the-growth-conundrum", "subs": [] },
			{
				"name": "Filament's Approach",
				"slug": "filament's-approach",
				"subs": [
					{ "name": "Filament's Distinctive Features", "slug": "filament's-distinctive-features" },
					{ "name": "Key Capabilities of Filament", "slug": "key-capabilities-of-filament" }
				]
			},
			{ "name": "The Road Ahead", "slug": "the-road-ahead", "subs": [] }
		]
	},
	"lite-paper-pulzaar---segmented-blockspace-commitments-for-the-interchain": {
		"metadata": {
			"category": "paper",
			"title": "Lite Paper: Pulzaar - Segmented blockspace commitments for the Interchain",
			"teaser": "Pulzaar is an open marketplace for interchain block segments which allows participants to express their execution preferences in a more nuanced way than is currently possible.",
			"published": "2023-01-09T00:00:00.000Z",
			"authors": ["patternmachine", "brapse", "xla"],
			"state": "archived"
		},
		"content": "\n## Intro\n\nBlockchains are timestamping/ordering services first and foremost, that is, consensus on the content\nand the order of blobs of data. Tendermint does this for Cosmos SDK applications. The blobs of data\nare messages inside transactions inside blocks. The consensus layer has no understanding of the\napplication, ie it does not care about the meaning of the blob of data, and in most cases the\napplication is built without awareness of the consensus layer. This lack of awareness of abstraction\nlayers can be exploited for gain, which is quantified via MEV (maximum extractable value). The\nexistence of these different layers that are unaware of each other is not just constrained to single\nnetworks but also works between and across multiple sovereign zones. We believe that systems need to\nbe designed to minimize these mismatches and internalize them to be economically secure. Against\nthis backdrop we introduce Pulzaar, a blockspace coordinator for the interchain.\n\nPulzaar is an open auction house for Interchain block segments. It allows builders to efficiently\ncoordinate execution across multiple chains and offer their customers value add services with the\nsegments they bought, e.g. execution gurantees. Only they will be able to efficiently navigate the\nincreasingly complex landscape formed by a growing number of sovereign appchains and interaction\nbetween them.\n\nChains can sell continuous segments of blocks to maximize revenue while retaining the option to\ninclude their own transactions to not compromise on censorship risk. With the help of modules\ntargeting Cosmos SDK, CosmWasm and other execution environments any chain can opt-in to integrate\nwith Pulzaar and bring builders into the domain of governance.\n\nOur main objective is: **Make** **Pulzaar permissionless, efficient and aligned with the Cosmos\nvision of sovereign zones.**\n\n## Motivation\n\nThe current state of the Cosmos ecosystem is complicated. Cosmos like most network suffers from the\nprincipal agent problem. Validators are selected by stakers to secure the network but have\n[monetary incentives](https://meka.tech/writing/analysing-the-atomic-arbitrage-space-in-osmosis-9fc75742-09e7-4352-8145-176ad47049cc)\nto maximize their individual revenue. Left unchecked, MEV extraction can grow to become a\ncentralizing force as a few large validators capture disproportionate value[^1] and offer outsized\nrewards to their stakers compared to smaller validators. With only large validators left, the dream\nof Cosmos as the community computer will die.\n\nThe problems stems from a few technical details within Tendermint/Cosmos SDK stack:\n\n**Temporal transaction ordering**: The ordering of transaction is not part of consensus, ie\nvalidators can order transactions as they please—though recently Cosmos SDK introduced a primitive\nfee market[^23] that hasn’t seen much adoption yet. But, a default Cosmos SDK app will order\ntransactions in a fifo manner. Although that ordering is considered to be fair by many, it comes\nwith a host of unwanted side-effects.\n\n1. For an open distributed system it is non-trivial to know which one of any two transactions\n   occurred first without having an explicit consensus instance for this problem and even then it is\n   a questionable endeavor[^11]\n2. If the ordering of transactions is not part of consensus then rational validators should sell\n   that right to the highest bidder off-chain making the fee, which makes the system less\n   transparent\n3. The absence of tools for agents to express execution preferences means that they will either try\n   to go with 2. or have to compete in latency games akin to HFT[^9]. These games pose a higher\n   barrier to entry (rent extraction of validators by selling colocation), are zero-sum and can also\n   negatively impact network health by causing congestion at times when blockspace is the most\n   valuable—e.g. during the Luna crash in May 2022 many people were unable to repay their loans\n   because blocks were congested by bots trying to arbitrage DEX pools and running\n   liquidations[^28].\n\nThese lead to an externalization of revenue and less community oversight due to off-chain\nagreements.\n\n**ABCI**: The Cosmos SDK is flexible enough to enable many applications that do not concern\nthemselves with consensus, but the recent past[^28] has shown us that ignoring the reality of how\nconsensus works has a very real influence on the security and viability of applications.\nUnfortunately the current pre 1.0 ABCI is not general enough to let applications hook into and\nchange how blocks are processed. That makes it impossible for the Cosmos SDK to have any insight on\nwhat happens on the consensus level without maintaining a fork of the Cosmos SDK.\n\nThe reoccurring theme is a lack of separation of concerns, which makes it hard to incentivize\nspecialized actors to compete in a manner that is not detrimental to the network. Along with the\nmissing open infrastructure for users to express execution preferences it leaves us in a suboptimal\nsituation.\n\nThis is especially pertinent to cross chain MEV which will most likely dwarf the MEV available on\nany single chain and present massive incentives for large validators who are active on many chains\nto capture this value. Without an open market, these validators will most likely favor bilateral\nagreements with other actors which are opaque and further entrench their power.\n\n## State of the solution space\n\nThe problems outlined in the previous section are not exclusive to the Interchain ecosystem and in\nthis section we want to give a non-exhaustive overview of other solutions before describing ours.\n\nResolving principal agent problems in the context of blockchains is generally done via two\napproaches, or a mix of them:\n\n1. Internalizing externalities and unbundling the power of the agent.\n2. Removing power and replacing it with randomness\n\nFor example, the ordering of transactions is currently not part of Tendermint consensus, which means\nthat validators can order them freely. With approach 1. validators might no longer build blocks but\nonly concern themselves with consensus and outsource the block building to specialized builders who\ncompete in an open market to produce optimal blocks.\n\nMost of the following techniques can be mixed and matched to produce systems that make different\nassumptions about execution guarantees.\n\n### Proposer-builder separation\n\n**mev-geth/mev-relay:** The Flash Boys 2.0 paper[^2] was the first comprehensive review of bot\nactivity in the Ethereum mempool. Bots were observed competing for opportunities via (priority) gas\nauctions (PGA), i.e. bidding via gas prices to be included before or after a target transaction\nbecause miners typically ordered transaction by gas price. By the end of 2020 the spam caused by\nthis behaviour had gotten so severe that a newly formed research collective named Flashbots\nintroduced mev-geth and mev-relay[^3]. mev-geth is a modified version of the geth software run by\nall miners which connects to the mev-relay. By running this patch miners allow outsiders to submit\nbundles of transactions via the mev-relay. The mev-relay runs a sealed bid auctions and only the\nwinning bundles of this auction lands on chain, reducing spam previously caused by searchers.\nAnother upside for searchers is the better execution guarantee because a bundle is only included if\nthe transactions contained succeed. The first bundle was included in a block on 2020-12-29[^4] and\nby 2021-05 more than 90% of Ethereum hash rate participated[^5]. Flashbots offered a crucial service\nin time of need but it is also important to mention that the system was fully based on trust and\nreputation and any organization with less integrity could’ve wrecked a lot of havoc. On the\nTendermint side, there are [Skip](https://github.com/skip-mev/mev-tendermint) and\n[Zenith](https://meka.tech/zenith) which offer similar services as flashbots do.\n\n**mev-boost**: While wildly successful, mev-geth/mev-relay was always intended to be a temporary\nsolution until an in-protocol mechanism is ready for production. With Ethereum’s transition from PoW\nto PoS mev-geth got an upgrade to mev-boost. Before, Flashbots acted as the single builder of blocks\nfor mev-geth operators. mev-boost[^6] allows validators (block proposers) to not just use Flashbots\nbut connect their node to many relays which aggregate many competing builders. mev-boost was made\npossible by collaboration of many Ethereum ecosystem participants who produced a unified interface\nfor block builders[^7]. This is still not an in-protocol solution but starts removing Flashbot from\nits privileged position as the sole block builder while the slower moving Ethereum base layer tries\nto land a protocol native solution.\n\n**PBS**: The proposer-builder-separation[8] design proposed by Vitalik Buterin as an in-protocol\nsolution is the foundation for most efforts in the Ethereum ecosystem with the goal to remove as\nmany trust assumptions as possible between proposer and builder to enable a more open market. For\nexample, with the current mev-relay block builders have to trust the relay to not steal their\nbundles, which would make that the establishment of some off-chain reputation registry for both\nproposers and builders very likely, in turn making the system less open.\n\nThese three systems represent one approach to dealing with execution guarantees/mev, that is, as\nsomething that needs to be internalized and made legible to the consensus system because it allows\nbetter alignment of incentives for all parties involved and reduces trust assumptions. There are\nteams working on similar systems for other blockchains[^10][^14]. This is the approach that we\nbelieve to be the best.\n\n### Fair sequencing\n\nAnother class of systems tries to focus on “fairness” achieved by establishing a canonical temporal\nordering for transactions, which is probably impossible in an open adversarial setting and none of\nthese systems have seen any open deployments to put these claims to test.\n\n**Bullshark/Tusk**: These rely on secure, reliable broadcast systems and their main insights is the\ndecoupling of mempool (dissemination of transactions) and consensus on just metadata to achieve high\nthroughput. To make the system work, transactions are placed into a DAG which can then be used to\nestablish a temporal order.\n\n**Chainlink FSS**: The Fair Sequencing Service[^12] that Chainlink wants to offer is based on the\nAequitas protocol[^11] and can best be described as an additional round of consensus on the order of\ntransactions observed by consensus nodes.\n\n### Cryptography\n\nNext, we consider cryptographic means, with the goal of preventing “bad” behaviour, eg front\nrunning, by hiding transaction content.\n\n**Threshold Encryption**: Using threshold encryption schemes for transactions or blocks is\nconceptually the same as commit-reveal schemes, though they differ in mechanics. Both achieve\nfrontrunning resistance in return for added latency. One recent example is Ferveo[^13], which\ndetails one such system and integrates it tightly into Tendermint consensus to end up with a fairly\nefficient system, that provides transaction hiding as long as 2/3 of the stake is not colluding,\nthough the system can not prove collusion.\n\n**SGX/TEE**: Secret network[^15] uses keys held inside trusted hardware to allow operations on\nencrypted transactions and state. A user encrypts their transaction to one of the keys held inside\nthe secure enclaves in theory protecting them from front running. Intel SGX or TEEs in general are\nvery enticing for protocol designers because if we assume trusted hardware exists, ie an execution\nenvironment that is opaque to the host machine, then many protocol designs can be much\nsimpler—unfortunately, it’s been a flawed assumption thus far[^27].\n\n### Auctions\n\nAll previous systems try to be generic to work with any application but applications can be designed\nin a way to minimize their externalities or internalize as much of it as possible.\n\n**PFOF**: Payment for order flow is one tool that can easily be adopted at an application level to\ninternalize some externalities. This should be of particular interest for appchains because they are\nalready running custom software that could easily be modified to include this functionality, e.g. on\nOsmosis automatic backrunning could be implemented that way. One live product with this focus is\nRook[^16].\n\n**Batch auctions**: The high frequency trading arms race observed since the early 2000s prompted\nBudish et al[^20] to suggest replacing the continuous order book with batch auctions to remove the\nnecessity for zero sum latency games. Batch auctions being a fit for blockchains with blocks being\nthe natural choice of batch was an early insight[^19] but the mechanism never really took off,\nalthough CowSwap seems to be gaining traction on EVM networks while Penumbra[^18] is going to launch\na zone utilizing batch auctions and cryptography to minimize front running.\n\n## Solution\n\nOver the course of 2022 we sketched out different designs for systems that would:\n\n- improve execution quality for users\n- better align incentives by properly attributing and sharing value created across involved parties\n- provide execution across multiple chains\n- be governable by participating chains or communities in general\n\nThe designs were informed by the realization that the commodity of execution is blockspace[^21] and\nthat many of the dynamics from other commodity markets apply, e.g. chains and builders will want to\nhedge via futures because commodities prices are typically very volatile. A related assumption is\nthat blockspace is abundant, which implies that itself is worth very little but execution guarantees\nare worth a lot, that is the privilege to change some state at a desired point in time.\n\nOur discussions with external stakeholders informed the formulation of the interchain scheduler[^26]\nwhile our internal discussions converged on similar concepts and we believe the idea provides a\nsolid foundation for what we need.\n\nThe service Pulzaar will provide is a market place for interchain block segments. Block segments are\ncontiguous blockspace which can be positioned reliably and verified on chain and provide a\ncensorship resistance stepping stone towards a scheduler for the interchain[^26] and ultimately\nbetter execution guarantees.\n\nThis market place should have the following high level properties:\n\n- opt-in: every chain can choose to participate\n- governable: if chains opt-in they have power over block space its validators sell\n- low implementation complexity\n- pre-confirmation privacy of bids\n- censorship resistance: it should be costly or even impossible for a builder to censor transactions\n- community owned and operated\n\nFor a functioning marketplace we need credible commitments[^25], be able to clearly identify the\nparties involved and facilitate payments between them.\n\nOn the supply side we have chains and delegators—who give validators/proposers the monopoly power to\nproduce block space—that want to sell continuous segments of blocks. On the demand side are block\nbuilders, who can buy these segments fill them with transactions.\n\nThe supply side, i.e. proposers, are already known entities for Tendermint/Cosmos SDK protocols.\nThey have explicit identities and duties enforced by the protocols for which they are typically\nenumerated. The goal is to make builders first class entities as well.\n\nOnce the market participants (proposer/builder) are legible we can introduce credible commitments\nfor both sides. Proposers, as representatives of the chains, commit to selling a segment at a given\nheight. Builders commit to paying for the segments they bid on. With these commitments payments can\nthen be facilitated or misbehaviour can be punished.\n\nTo get there we are going to produce:\n\n- **segment builder API specification**: open standard to be used for communication between builders\n  and proposers\n- **segment builder module**: allows validators to interact with builders, facilitates payments from\n  builders and govern builders\n- **auction module**: verify commitments to buy block segments, which can originate locally (builder\n  API) or remotely (Pulzaar) via IBC\n- **Pulzaar**: IBC connected Tendermint chain, that other chains use to auction off block segments\n  to builders, acting as a point of coordination to produce and enforce commitments\n\n## Trajectory - Escalating Odds\n\nFinally, we want to setup a trajectory for our work given our current understanding described in the\nprevious section.\n\nTo start out we are developing and operating a trusted block builder service, Zenith, for a few\nselected chains. This is the quickest way to provide value to validators and users, while minimizing\noutside dependencies on the Tendermint/Cosmos SDK code bases, which have a high bar for changes to\nensure quality and community alignment.\n\nOur goal is to offer protocol level integrations for a diverse set of Cosmos chains, but to do that\nwe need the applications to be aware of the consensus layer and modify the rules of block\nproduction. Unfortunalety ABCI is not powerful enough to offer that capability. We could maintain\nforks of Tendermint and the Comsos SDK allowing applications to have more control over the block\nbuilding process but that would come with many downsides and little upside. Instead we want to help\ngetting ABCI1.0[^17] deployed. ABCI1.0 was first proposed in early 2020 but has not made it into\nproduction by 2022-12. It extends ABCI to allow apps to hook into the lifecycle of block proposing,\ngiving us the flexibility we need. Celestia[^22] is one prominent system that also leans heavily on\nABCI1.0 and we want to help to finally get it into production.\n\nThe segment builder and auction modules can only be deployed once chains enable ABCI1.0 but we plan\non making them available as early as possible to give protocol developers plenty of time for\ncommunity feedback, integration and testing.\n\nTogether with the modules we will also be proposing an API specification for the communication\nbetween proposers and builders.\n\nPulzaar will be developed in parallel with all of the above as a series of public testnets and in\ncollaboration with stakeholders from different chains. The first two testnets will be dedicated to\nbasic functionality of the validator set and IBC interconectivity. Once these are working, we are\ngoing to be testing our auction mechanisms and pre-confirmation privacy protocols in an open\nsetting.\n\n## Conclusion\n\nIn this paper we outline some problems the Interchain ecosystem faces and what a market based\nsolution can look like.\n\nFuture works will formalize the specification of Pulzaar, research robust incentive mechanisms,\nproof systems and governance of these markets. Beyond that we want to extend Pulzaar to not just\nprovide a supply of blockspace to builders but also allow it to be an aggregator for user\npreferences, which in turn should enable better incentive alignment between all parties involved.\n\nIf those sound interesting and you want to collaborate, please reach out to\n[connect@pulzaar.zone](mailto:connect@pulzaar.zone).\n\n[^1]: [https://hackmd.io/@flashbots/mev-in-eth2#validator-reward-economics](https://hackmd.io/@flashbots/mev-in-eth2#validator-reward-economics)\n[^2]:\n    Daian, Philip, et al. \"Flash boys 2.0: Frontrunning, transaction reordering, and consensus\n    instability in decentralized exchanges.\" *arXiv preprint arXiv:1904.05234* (2019).\n\n[^3]: [https://ethresear.ch/t/flashbots-frontrunning-the-mev-crisis/8251](https://ethresear.ch/t/flashbots-frontrunning-the-mev-crisis/8251)\n[^4]: [https://medium.com/flashbots/flashbots-transparency-report-january-2021-922514de8b8a](https://medium.com/flashbots/flashbots-transparency-report-january-2021-922514de8b8a)\n[^5]:\n    Weintraub, Ben, et al. \"A Flash (bot) in the Pan: Measuring Maximal Extractable Value in Private\n    Pools.\" *arXiv preprint arXiv:2206.04185* (2022).\n\n[^6]: [https://boost.flashbots.net](https://boost.flashbots.net/)\n[^7]: [https://github.com/ethereum/builder-specs](https://github.com/ethereum/builder-specs)\n[^8]: [https://ethresear.ch/t/proposer-block-builder-separation-friendly-fee-market-designs/9725](https://ethresear.ch/t/proposer-block-builder-separation-friendly-fee-market-designs/9725)\n[^9]:\n    Budish, Eric, Robin S. Lee, and John J. Shim. *Will the market fix the market?: A theory of\n    stock exchange competition and innovati*. Cambridge: National Bureau of Economic Research, 2019.\n\n[^10]: [https://www.jito.wtf/](https://www.jito.wtf/)\n[^11]:\n    Kelkar, Mahimna, et al. \"Order-fairness for byzantine consensus.\" *Annual International\n    Cryptology Conference*. Springer, Cham, 2020.\n\n[^12]: [https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/](https://blog.chain.link/chainlink-fair-sequencing-services-enabling-a-provably-fair-defi-ecosystem/)\n[^13]:\n    Bebel, Joseph, and Dev Ojha. \"Ferveo: Threshold Decryption for Mempool Privacy in BFT\n    networks.\" *Cryptology ePrint Archive* (2022).\n\n[^14]: [https://github.com/marlinprotocol/mev-bor](https://github.com/marlinprotocol/mev-bor)\n[^15]: [https://scrt.network](http://scrt.network)\n[^16]: [https://www.rook.fi/](https://www.rook.fi/)\n[^17]: [https://github.com/tendermint/tendermint/tree/master/spec/abci%2B%2B](https://github.com/tendermint/tendermint/tree/master/spec/abci%2B%2B)\n[^18]: [https://penumbra.zone/](https://penumbra.zone/technology/swap)\n[^19]: [https://archive.devcon.org/archive/watch/1/liquidity-on-blockchains/?tab=YouTube](https://archive.devcon.org/archive/watch/1/liquidity-on-blockchains/?tab=YouTube)\n[^20]:\n    Budish, Eric, Peter Cramton, and John Shim. \"The high-frequency trading arms race: Frequent\n    batch auctions as a market design response.\" *The Quarterly Journal of Economics* 130.4 (2015):\n    1547-1621.\n\n[^21]: [https://www.aniccaresearch.tech/blog/consensus-capital-markets](https://www.aniccaresearch.tech/blog/consensus-capital-markets)\n[^22]: [https://celestia.org](https://celestia.org/)\n[^23]: [https://github.com/tendermint/tendermint/blob/master/docs/architecture/adr-067-mempool-refactor.md](https://github.com/tendermint/tendermint/blob/master/docs/architecture/adr-067-mempool-refactor.md)\n[^24]: [https://mirror.xyz/0x03c29504CEcCa30B93FF5774183a1358D41fbeB1/CPYI91s98cp9zKFkanKs_qotYzw09kWvouaAa9GXBrQ](https://mirror.xyz/0x03c29504CEcCa30B93FF5774183a1358D41fbeB1/CPYI91s98cp9zKFkanKs_qotYzw09kWvouaAa9GXBrQ)\n[^25]: [https://github.com/flashbots/mev-research/blob/main/FRPs/active/FRP-26.md](https://github.com/flashbots/mev-research/blob/main/FRPs/active/FRP-26.md)\n[^26]: [https://informal.systems/2022/10/24/interchain-scheduler-design-update](https://informal.systems/2022/10/24/interchain-scheduler-design-update)\n[^27]: [https://sgx.fail/](https://sgx.fail/)\n[^28]: [https://twitter.com/flipsidecrypto/status/1524550290447343617](https://twitter.com/flipsidecrypto/status/1524550290447343617)\n",
		"slug": "lite-paper-pulzaar---segmented-blockspace-commitments-for-the-interchain",
		"toc": [
			{ "name": "Intro", "slug": "intro", "subs": [] },
			{ "name": "Motivation", "slug": "motivation", "subs": [] },
			{
				"name": "State of the solution space",
				"slug": "state-of-the-solution-space",
				"subs": [
					{ "name": "Proposer-builder separation", "slug": "proposer-builder-separation" },
					{ "name": "Fair sequencing", "slug": "fair-sequencing" },
					{ "name": "Cryptography", "slug": "cryptography" },
					{ "name": "Auctions", "slug": "auctions" }
				]
			},
			{ "name": "Solution", "slug": "solution", "subs": [] },
			{
				"name": "Trajectory - Escalating Odds",
				"slug": "trajectory---escalating-odds",
				"subs": []
			},
			{ "name": "Conclusion", "slug": "conclusion", "subs": [] }
		]
	},
	"position-paper": {
		"metadata": {
			"category": "paper",
			"title": "Position Paper",
			"teaser": "At Filament, our vision is a world where communities are durable and thrive sustainably. By addressing current shortcomings and implementing smart, user-friendly, and adaptable solutions, Filament is committed to fostering a thriving crypto ecosystem.",
			"published": "2024-06-13T00:00:00.000Z",
			"authors": ["brapse"],
			"state": "published"
		},
		"content": "## Introduction\n\nCrypto has revolutionized how communities organize by enabling anyone to issue a token. What once was the privilege of nation-states—launching a currency—has become as straightforward in the era of Web3 as deploying a website was in Web2. Standardized interfaces unlock DeFi infrastructure and new markets, making ownership a composable primitive. \nHowever, this newfound power is not without its challenges. Tokens represent a double-edged sword. While they foster economic freedom, they also expose communities to financial incentives that may undermine their core values. \n\nA token's value is inherently tied to the utility derived from a sustainable community. Distributing tokens, therefore, becomes a race to cultivate that community before the token's value goes to zero. There exists many methods of distributing tokens, but they all have problems.\n\n## The Problems\n\nBlock rewards have been an effective way to distribute tokens, with Bitcoin being a prime example. Bitcoin incentivizes network security by providing block rewards to actors who provide hashing power. Driven by concerns of wasted electricity, proof of stake has evolved to use economic stake as a proxy for hashing power. Proof of stake has become a popular alternative, providing a compelling mechanism for incentivizing stake to secure the network. \n\nHowever, it is hard to assess how much security is needed. Most protocols overpay for security while under allocating resources to new forms of productivity. Increasingly, these networks provide more than just stores of value and, therefore, need additional resources than just security.  \n\nBeyond securing the network, protocols have allocated a portion of their balance sheet to bootstrap initial demand. Airdrops [try to reward productive behavior](https://arxiv.org/pdf/2312.02752) while avoiding being [farmed](https://www.theblock.co/post/292502/layerzero-offers-sybil-farmers-chance-to-self-report-in-the-name-of-durability), but often without success. \n\nFarming is a professional activity and most protocols don’t stand a chance. Isolating productive behavior with limited data and minimal tooling against a highly incentivized adversary is a recipe for disaster. Additionally, whatever criteria are set will be the [source of contention](https://unchainedcrypto.com/5-reasons-e-beggars-are-not-happy-with-eigenlayers-airdrop/). Too broad, and the [airdrop fails to concentrate on real users](https://6thman.ventures/writing/airdrops-an-analysis-of-over-2000000-events/); too fine, and rewards become concentrated, failing to decentralize the network. Arbitrary criteria behind an opaque process create rifts within the community. When trust is broken, it’s very difficult to repair, regardless of the value of the product.\n\nPoints systems have emerged to enhance airdrops by offering much-needed flexibility. Points represent a loose social contract centrally issued with ambiguous conversion criteria. They can be adjusted as market conditions evolve without prematurely diluting the issuer. However, points don't confer ownership of the protocol. Recipients have no say in network development or the conversion of points to tokens. [They often fail to align expectations](https://www.coindesk.com/tech/2024/05/09/eigenlayers-eigen-airdrop-might-signal-demise-of-once-popular-points/) between issuers and recipients. Without a mechanism to resolve disputes, points also struggle to align the community with how the token should be distributed.\n\nToken distribution methods have become more social over time. With this shift, It’s become increasingly difficult to build consensus around what constitutes productive behavior in the systems we are building.  For decentralized protocols to last, we must marry this social reality with technical innovation. \n\nThe goal of Filament is to help communities find a durable balance between financial incentives and community objectives.\n\n## Areas of Improvement\n\nWith the problem in mind, Filament aims to improve the toolchain for distributing tokens in the following ways: \n\n**Improved User Experience**: The user experience of airdrops should be as reliable as that of e-commerce, with standard flows that are well-audited and easily implemented. An SDK will provide primitives for white-label integrations. Retail users should be able to interact with new projects without fear of compromising their safety. \n\n**Improved Data Access**: Better ways of accessing historical data, easily composed with smart contracts. Filament will provide a DSL for seamless querying of multiple data sources. Targeting a larger set of actors, wallets, relayers, and AI agents should be easy.\n\n**Repeatability**: Campaigns should be easily tweaked and replicated, fostering innovation through open iteration and collective learning. Filament should provide an open platform for replicating successful solutions and discarding ineffective methods.\n\n**Programmable Emissions**: Emissions should be dynamic, tied to different vesting criteria, and aligned with community objectives. Issuers will be able to deploy a new set of primitives adhering to common interfaces to compose with existing infrastructure.\n\n**Governance**: Incentives should align between issuers and recipients, integrating various actors to form a consensus. Participants should have a say in token distribution and a reliable dispute resolution process.\n\n## How Filament Works\n\nFilament offers a new way of distributing tokens by coordinating a set of actors.\n\n**Campaigner:** Actors willing to put capital at risk instigate change in the form of a budget. Campaigners can be Foundations with significant allocations, DAOs with specific mandates, impatient investors, or even individuals who want to see a change realized. Campaigners are incentivized by the productivity generated by the campaign.\n\n**Participants:** Actors who perform some work incentivized by the campaign. Participants can be individuals or parts of the supply chain, such as wallets, relayers, or autonomous agents maximizing profits. What binds these groups together is their desire and ability to contribute to the campaign according to the set criteria. Participants are incentivized by their fair share of the budget.\n\n**Stakers:** Bonded actors who specialize in ratifying social consensus. Stakers should not only be aligned with the Campaigner and Participants but also with the system's long-term viability to execute campaigns reliably and successfully.\n\nFilament is launching a network comprised of the Filament Hub and outpost smart contracts. The Filament Hub will serve as coordination points for orchestrating incentive campaigns, witnessing interchain state transitions, and providing local records of incentivized behavior.\n\n**Playbooks**: The smart contract language of the Filament Hub. A declarative language, allowing builders to design incentives, combining on and off-chain data sources for defining value flow and distribution. Playbooks can be shared and provide templates that make functional airdrops easily repeatable.\n\n**Outposts**: These are Smart contracts deployed on various platforms that interact with the Filament Hub. They manage funds and provide the primitives for programmatic emissions.\n\nFilament will also provide APIs, dashboards, and SDKs to make designing, deploying, and analyzing campaigns intuitive.\n\n## Trajectory\n\nThe following section provides a trajectory toward a fully decentralized network operated by a permissionless set of actors. The network will use a native token to bootstrap participation and move towards a supply chain sustained by fees and commission. The roadmap will proceed in three stages: heat, ignition, and finally, combustion:\n\n### Heat\nEstablish the core protocol interfaces. The system will be restricted for both Campaigner and Stakers but will be open for Participants. Campaigners run campaigns in exchange for Filament Points which will be passed on to their users. Stakers will bootstrap governance in exchange for native incentives.\n\n### Ignition\nThe Mainnet will launch with stable interfaces that are ready to operate production interactions without significant trust assumptions. A native token will be issued and distributed to early contributors. Stakers will be subsidized with emissions.\n\n### Combustion\nA Fully operational system with permissionless Campaigners, Stakers, and Participants. Outposts will be deployed on multiple networks, providing access to larger campaign audiences. Campaigners will be able to elect alternative staking positions, such as LP token holders, to align campaign outcomes with more diverse sets of actors. The commission will be paid to Stakers.\n\n## Conclusion\n\nFilament has a vision for Web3, where communities are durable and thrive. Tokens offer immense potential but come with significant challenges. Bootstrapping a community with financial incentives is difficult, and existing tools are not able to solve the problem. \nAirdrops can work if we accept the reality that targeting productive behavior is a social process. Filament provides a new set of tools that make targeting easier and conflict resolution possible. Protocols can avoid community backlash and allocate their token supply with confidence by providing a process of ratifying social consensus. Ultimately, tokens should be distributed and communities should be decentralized to provide new forms of ownership. This is the purpose of Web3.\n",
		"slug": "position-paper",
		"toc": [
			{ "name": "Introduction", "slug": "introduction", "subs": [] },
			{ "name": "The Problems", "slug": "the-problems", "subs": [] },
			{ "name": "Areas of Improvement", "slug": "areas-of-improvement", "subs": [] },
			{ "name": "How Filament Works", "slug": "how-filament-works", "subs": [] },
			{
				"name": "Trajectory",
				"slug": "trajectory",
				"subs": [
					{ "name": "Heat", "slug": "heat" },
					{ "name": "Ignition", "slug": "ignition" },
					{ "name": "Combustion", "slug": "combustion" }
				]
			},
			{ "name": "Conclusion", "slug": "conclusion", "subs": [] }
		]
	}
}
